Revit 2027 API
View.Print Method
Print this view with the default view template and using the print setting of the current active document.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void Print()
Public Sub Print
public:
void Print()
member Print : unit -> unit
Exceptions
Exception | Condition
InvalidOperationException | Thrown when the view cannot be printed.
See Also
Reference
View Class
Print Overload
Autodesk.Revit.DB Namespace